# AlphanumericRevisionSettings Constructor

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AlphanumericRevisionSettings Constructor
AlphanumericRevisionSettings Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AlphanumericRevisionSettings()()()() | Constructs an AlphanumericRevisionSettings with a simple, default sequence. |
| AlphanumericRevisionSettings(AlphanumericRevisionSettings) | Constructs a new copy of the input AlphanumericRevisionSettings object. |
| AlphanumericRevisionSettings(IList<(Of <<'(String>)>>), String, String) | Constructs an AlphanumericRevisionSettings object. |

# See Also
AlphanumericRevisionSettings Class
AlphanumericRevisionSettings Members
Autodesk.Revit.DB Namespace